{
  "receipe-post": [
    {
      "date": "September 05, 2020",
      "name": "Croissants",
      "prep": "30 mins",
      "cook": "45 mins",
      "yields": "8 Croissants",
      "stars": "4",
      "image": "img/bg-img/cros.jpg",
      "instructions1": [
        "Twenty-four hours before serving, start the détrempe: In the bowl of a stand mixer fitted with the dough hook, combine the flour, sugar, salt, and yeast, and stir to combine. Create a well in the center, and pour in the water and milk. Mix on low speed until a tight, smooth dough comes together around the hook, about 5 minutes. Remove the hook and cover the bowl with a damp towel. Place the dough slashed-side up inside the same mixing bowl, cover with plastic wrap and let rise at room temperature until about 1½ times its original size, 45 minutes to 1 hour. Transfer the bowl to the refrigerator and chill for at least 4 hours and up to 12."
      ],
      "ingredients": [
        "605 grams all-purpose or bread flour, plus more for dusting",
        " 66 grams granulated sugar",
        " 7 grams active dry yeast",
        " 12 grams kosher salt",
        " 214 grams water, at room temperature",
        " 120 grams whole milk, at room temperature",
        " 57 grams unsalted butter, cut into ½-inch pieces, chilled",
        " 340 grams unsalted European or European-style butter (3 sticks), chilled"
      ]
    },
    {
      "date": "August 16, 2019",
      "name": "Perfect Eclairs",
      "prep": "10 mins",
      "cook": "30 mins",
      "yields": "10 Eclairs",
      "stars": "3",
      "image": "img/bg-img/ee.jpg",
      "instructions1": [
        "In a Medium saucepan, combine 1/2 cup water, 1/2 cup milk, 8 Tbsp butter, 1 tsp sugar and 1/4 tsp salt. Bring to a boil over medium heat then remove from heat and stir in 1 cup flour all at once with a wooden spoon. One flour is incorporated, place back over medium heat about 1 1/2 to 2 minutes stirring constantly (to release extra moisture and partially cook flour), or until dough comes together into a smooth ball and a thin film forms on bottom of pan. Transfer to a large mixing bowl and beat using an electric hand mixer on medium speed for 1 minute to cool the mixture slightly. Add 4 eggs, 1 at a time, allowing each egg to fully incorporate between additions. Bake at 425˚F for 10 minutes. Without opening oven, reduce temperature to 325˚F and bake for 30 minutes longer or until golden brown. Transfer to wire rack to cool while making pastry cream."
      ],
      "ingredients": [
        "1/2 cup water",
        " 1/2 cup whole milk",
        " 8 Tbsp unsalted butter",
        " 1 tsp granulated sugar",
        " 1 cup all-purpose flour",
        " 4 large eggs",
        " 1/4 tsp cinnamon",
        " 1 cup fresh blueberries"
      ]
    },
    {
      "date": "September 05, 2020",
      "name": "Cream Filled Cannoli",
      "prep": "40 mins",
      "cook": "10 mins",
      "yields": "5 Servings",
      "stars": "4",
      "image": "img/bg-img/cannolisiciliani.jpg",
      "instructions1": [
        "Add all the ingredients for the pastry shells to a large bowl. While mixing continuously, add wine or vinegar, then knead until you have a firm ball of dough with a texture similar to Play-Doh. Cover the bowl with a kitchen towel, and set aside for 30 minutes so that the dough can rest. Using a rolling pin, roll the dough out to thin sheets. Brush the edges of the dough with a beaten egg white, then overlap, and press lightly so the dough sticks together. Once all cannoli shells are assembled, fry in hot lard or olive oil. Transfer each finished cannoli onto a baking tray lined with paper towels to drain. Wait for them to dry and cool completely, then remove the tubes. Strain the ricotta through a fine mesh sieve, then combine the ricotta with sugar, vanilla extract, and chocolate flakes. Fill the piping bag with ricotta cream, then pipe the filling on each side of each cannoli shell."
      ],
      "ingredients": [
        "150g plain flour",
        " 50g sugar",
        " 25g lard",
        " 10g cocoa powder, optional",
        " 1 egg",
        " Vanilla extract",
        " Dark chocolate",
        " Chopped pistachios, to decorate"
      ]
    },
    {
      "date": "June 27, 2022",
      "name": "Sugar Cookies",
      "prep": "20 mins",
      "cook": "45 mins",
      "yields": "24 Cookies",
      "stars": "5",
      "image": "img/bg-img/keks.jpg",
      "instructions1": [
        "Preheat the oven to 190 degrees C. Stir flour, baking soda, and baking powder together in a small bowl. Beat sugar and butter together in a large bowl with an electric mixer until smooth. Beat in egg and vanilla. Gradually blend in flour mixture. Roll dough into walnut-sized balls and place 2 inches apart onto ungreased baking sheets. Bake in the preheated oven until edges are golden, 8 to 10 minutes. Cool on the baking sheets briefly before removing to a wire rack to cool completely."
      ],
      "ingredients": [
        "2 ¾ cups all-purpose flour",
        " 1 teaspoon baking soda",
        " 1 cup butter, softened",
        " 1 ½ cups white sugar",
        " 1 ½ cups white sugar",
        " 1 teaspoon vanilla extract",
        " Sugar to coat them in"
      ]
    },
    {
      "date": "May 14, 2021",
      "name": "Chimney cake recipe",
      "prep": "45 mins",
      "cook": "15 mins",
      "yields": "10 Servings",
      "stars": "4",
      "image": "img/bg-img/Chimney-Cake-Kurtoskalac.jpg",
      "instructions1": [
        "Mix the yeast in a large bowl with the flour, sugar and a pinch of salt until well combined. Add the egg, milk and butter and bring together to form a wet dough using your hands. Tip onto a lightly floured surface and knead for 10-15 mins until a smooth and elastic ball has formed. Place in a greased bowl, cover with a piece of clingfilm and let it rise in a warm place for an hour, or until doubled in size. Tear two sheets of tin foil four inches longer than your rolling pin and wrap both sheets around the pin, turning the end pieces so that the rolling pin is entirely covered. If you have two rolling pins then repeat on the second. Brush the foiled rolling pins in melted butter, save the rest of this butter for later on. Mix the ground walnuts, sugar and cinnamon together in a tray that is long enough to fit your rolling pin. Remove the dough from the bowl and roll it out in a square roughly 45x45cm in size and ½cm thick. Slide off the rolling pin and carefully snap in half. Repeat with the second pin so you are left with four coils of Chimney Cake!"
      ],
      "ingredients": [
        "7g dried yeast",
        " 400g plain flour",
        " 40g caster sugar",
        " 200ml whole milk",
        " 120g butter, at room temperature plus 40g butter, melted",
        " 50g caster sugar",
        " 80g caster sugar",
        " 1 tsp ground cinnamon"
      ]
    },
    {
      "date": "February 13, 2024",
      "name": "Mexican Pan Dulce Cookies",
      "prep": " 1 hr 30 mins",
      "cook": "10 mins",
      "yields": "32 Servings",
      "stars": "5",
      "image": "img/bg-img/Conchasscaled.jpg",
      "instructions1": [
        "In a large bowl, cream together the butter and sugar until light and fluffy, about 1 minute. Add the eggs, egg yolks and vanilla extract and beat until well combined. Divide in half and wrap each half in plastic wrap. Add the flour, a little at a time, mixing well after each addition. Continue adding until the dough comes together and is smooth. Depending on which topping variations you'll do, you'll want to divide the mixture evenly into desired amount. Again, that's only if you're making all four different colors. Knead by hand until evenly colored. Cover with plastic wrap and set aside. Working with one half of dough at a time, roll out onto a lightly floured work surface, to 1/2-inch thick. Use a 2-inch round cookie cutter to cut out the cookies and place on the prepared baking sheets, spacing them out 2-inches apart. Chill until ready to use. Bake until lightly golden brown around the edges, about 10 to 12 minutes. Cool on baking sheets for 5 minutes before transferring to a wire rack to cool completely.!"
      ],
      "ingredients": [
        "1 cup unsalted butter softened",
        " 1 cup granulated sugar",
        " 2 large eggs room temperature",
        " 3 large egg yolks room temperature",
        " 1 1/2 teaspoons vanilla extract",
        " 3 1/2 cups all-purpose flour",
        " 1 1/2 teaspoons baking powder",
        " 1/4 teaspoon salt"
      ]
    },
    {
      "date": "June 03, 2022",
      "name": "Baklava Recipe",
      "prep": "50 mins",
      "cook": "20 mins",
      "yields": "18 Servings",
      "stars": "3",
      "image": "img/bg-img/Hafiz-Mustafa-Baklavajpg",
      "instructions1": [
        "Place the sugar and water in a saucepan and heat stove-top, stirring occasionally, until sugar dissolves. Add the honey, orange extract, and whole cloves (cloves are optional here); stir to mix. Bring to a boil, then lower heat and let simmer for about 25 minutes. Remove syrup from heat. Add lemon juice. Remove the whole cloves and let the syrup cool completely (it will thicken a little bit). In the bowl of a food processor fitted with a blade, add the pistachios, walnut, and hazelnuts. Pulse a few times to chop. Transfer to a large mixing bowl and add sugar, cinnamon, and ground cloves. Mix well to combine. Carefully unroll the thawed phyllo pastry and place the sheets in between two clean kitchen towels. This will help keep the phyllo from breaking while you work. Prepare a 9”x 13”x 2” baking pan. Brush the interior of the baking pan with some of the melted butter. To assemble the baklava, take one sheet of phyllo and place it in the pan (for this size pan, I typically fold my phyllo sheet in half, and it fits perfectly. You can also do a bit of trimming using a pair of kitchen shears). Brush the top of the phyllo sheet with the melted butter. Repeat this process a few more times until you have used up about ⅓ of the phyllo pastry, each layer being brushed with the melted butter. Continue assembling the baklava, one sheet of phyllo pastry at a time using another ⅓ of the phyllo. Again, brush each layer with a bit of the melted butter. Distribute the remaining ½ of the nut mixture evenly over the top layer of phyllo. Finish the remaining ⅓ of the phyllo pastry following the same process, laying one folded sheet at a time and brushing each layer with melted butter. Brush the very top sheet of phyllo with butter. Using a good sharp knife, cut the pastry into diamond shaped pieces (anywhere from 24 to 36 pieces) about ½-inch deep."
      ],
      "ingredients": [
        "Phyllo pastry - find frozen phyllo dough in the freezer section next to things like pie crust.",
        " Pistachios, walnuts, hazelnut, sugar, ground cinnamon, pinch of ground cloves.",
        " Honey syrup- water, sugar, honey, and lemon juice"
      ]
    }
  ]
}
